#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: renovate[bot], Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113502121507]
data.sakuracloud_archive.ubuntu_archive: Reading...
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113502121508]
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113502121515]
sakuracloud_disk.k8s_rook_disk[7]: Refreshing state... [id=113502121522]
sakuracloud_disk.k8s_rook_disk[5]: Refreshing state... [id=113502121536]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113502121519]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113502121510]
sakuracloud_disk.k8s_rook_disk[6]: Refreshing state... [id=113502121524]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113502121511]
sakuracloud_disk.k8s_rook_disk[4]: Refreshing state... [id=113502121517]
data.sakuracloud_archive.ubuntu_archive: Read complete after 2s [id=113402076881]
sakuracloud_disk.k8s_rook_disk[3]: Refreshing state... [id=113502121513]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113502121509]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113502121514]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113502121516]
sakuracloud_disk.k8s_worker_node_disk[5]: Refreshing state... [id=113502121527]
sakuracloud_disk.k8s_worker_node_disk[4]: Refreshing state... [id=113502121534]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113502121533]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113502121526]
sakuracloud_disk.k8s_worker_node_disk[7]: Refreshing state... [id=113502121523]
sakuracloud_disk.k8s_worker_node_disk[6]: Refreshing state... [id=113502121529]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113502121528]
sakuracloud_disk.k8s_worker_node_disk[3]: Refreshing state... [id=113502121525]
sakuracloud_disk.k8s_router_disk[0]: Refreshing state... [id=113502121512]
sakuracloud_server.k8s_router[0]: Refreshing state... [id=113502121539]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113502121547]
sakuracloud_server.k8s_worker_node[4]: Refreshing state... [id=113502121558]
sakuracloud_server.k8s_worker_node[3]: Refreshing state... [id=113502121575]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113502121556]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113502121562]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113502121549]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113502121544]
sakuracloud_server.k8s_worker_node[7]: Refreshing state... [id=113502121584]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113502121561]
sakuracloud_server.k8s_worker_node[5]: Refreshing state... [id=113502121559]
sakuracloud_server.k8s_worker_node[6]: Refreshing state... [id=113502121557]
sakuracloud_subnet.bgp_subnet: Refreshing state... [id=15680]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                = "113502121509" -> (known after apply)
        name              = "k8s-dev-control-plane-1"
      ~ server_id         = "113502121549" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                = "113502121514" -> (known after apply)
        name              = "k8s-dev-control-plane-2"
      ~ server_id         = "113502121547" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                = "113502121516" -> (known after apply)
        name              = "k8s-dev-control-plane-3"
      ~ server_id         = "113502121544" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_router_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_router_disk" {
      ~ id                = "113502121512" -> (known after apply)
        name              = "k8s-dev-router-1"
      ~ server_id         = "113502121539" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113502121528" -> (known after apply)
        name              = "k8s-dev-worker-node-1"
      ~ server_id         = "113502121556" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113502121533" -> (known after apply)
        name              = "k8s-dev-worker-node-2"
      ~ server_id         = "113502121561" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113502121526" -> (known after apply)
        name              = "k8s-dev-worker-node-3"
      ~ server_id         = "113502121562" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[3] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113502121525" -> (known after apply)
        name              = "k8s-dev-worker-node-4"
      ~ server_id         = "113502121575" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[4] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113502121534" -> (known after apply)
        name              = "k8s-dev-worker-node-5"
      ~ server_id         = "113502121558" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[5] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113502121527" -> (known after apply)
        name              = "k8s-dev-worker-node-6"
      ~ server_id         = "113502121559" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[6] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113502121529" -> (known after apply)
        name              = "k8s-dev-worker-node-7"
      ~ server_id         = "113502121557" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[7] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113502121523" -> (known after apply)
        name              = "k8s-dev-worker-node-8"
      ~ server_id         = "113502121584" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_control_plane[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks            = [
          - "113502121509",
        ] -> (known after apply)
        id               = "113502121549"
        name             = "k8s-dev-control-plane-1"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks            = [
          - "113502121514",
        ] -> (known after apply)
        id               = "113502121547"
        name             = "k8s-dev-control-plane-2"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks            = [
          - "113502121516",
        ] -> (known after apply)
        id               = "113502121544"
        name             = "k8s-dev-control-plane-3"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_router[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_router" {
      ~ disks            = [
          - "113502121512",
        ] -> (known after apply)
        id               = "113502121539"
        name             = "k8s-dev-router-1"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113502121528",
          - "113502121511",
        ] -> (known after apply)
        id               = "113502121556"
        name             = "k8s-dev-worker-node-1"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113502121533",
          - "113502121510",
        ] -> (known after apply)
        id               = "113502121561"
        name             = "k8s-dev-worker-node-2"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113502121526",
          - "113502121519",
        ] -> (known after apply)
        id               = "113502121562"
        name             = "k8s-dev-worker-node-3"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[3] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113502121525",
          - "113502121513",
        ] -> (known after apply)
        id               = "113502121575"
        name             = "k8s-dev-worker-node-4"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[4] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113502121534",
          - "113502121517",
        ] -> (known after apply)
        id               = "113502121558"
        name             = "k8s-dev-worker-node-5"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[5] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113502121527",
          - "113502121536",
        ] -> (known after apply)
        id               = "113502121559"
        name             = "k8s-dev-worker-node-6"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[6] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113502121529",
          - "113502121524",
        ] -> (known after apply)
        id               = "113502121557"
        name             = "k8s-dev-worker-node-7"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[7] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113502121523",
          - "113502121522",
        ] -> (known after apply)
        id               = "113502121584"
        name             = "k8s-dev-worker-node-8"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 12 to add, 12 to change, 12 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>